RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/fmc_reg.h
#define FMC_XOMR2STS_SIZE_Pos            (0)                                               /*!< FMC_T::XOMR2STS: SIZE Position         */
#define FMC_XOMR2STS_SIZE_Msk            (0xfful << FMC_XOMR2STS_SIZE_Pos)                 /*!< FMC_T::XOMR2STS: SIZE Mask             */

#define FMC_XOMR2STS_BASE_Pos            (8)                                               /*!< FMC_T::XOMR2STS: BASE Position         */
#define FMC_XOMR2STS_BASE_Msk            (0xfffffful << FMC_XOMR2STS_BASE_Pos)             /*!< FMC_T::XOMR2STS: BASE Mask             */

#define FMC_XOMR3STS_SIZE_Pos            (0)                                               /*!< FMC_T::XOMR3STS: SIZE Position         */
#define FMC_XOMR3STS_SIZE_Msk            (0xfful << FMC_XOMR3STS_SIZE_Pos)                 /*!< FMC_T::XOMR3STS: SIZE Mask             */

#define FMC_XOMR3STS_BASE_Pos            (8)                                               /*!< FMC_T::XOMR3STS: BASE Position         */
#define FMC_XOMR3STS_BASE_Msk            (0xfffffful << FMC_XOMR3STS_BASE_Pos)             /*!< FMC_T::XOMR3STS: BASE Mask             */

#define FMC_XOMSTS_XOMR0ON_Pos           (0)                                               /*!< FMC_T::XOMSTS: XOMR0ON Position        */
#define FMC_XOMSTS_XOMR0ON_Msk           (0x1ul << FMC_XOMSTS_XOMR0ON_Pos)                 /*!< FMC_T::XOMSTS: XOMR0ON Mask            */

#define FMC_XOMSTS_XOMR1ON_Pos           (1)                                               /*!< FMC_T::XOMSTS: XOMR1ON Position        */
#define FMC_XOMSTS_XOMR1ON_Msk           (0x1ul << FMC_XOMSTS_XOMR1ON_Pos)                 /*!< FMC_T::XOMSTS: XOMR1ON Mask            */

#define FMC_XOMSTS_XOMR2ON_Pos           (2)                                               /*!< FMC_T::XOMSTS: XOMR2ON Position        */
#define FMC_XOMSTS_XOMR2ON_Msk           (0x1ul << FMC_XOMSTS_XOMR2ON_Pos)                 /*!< FMC_T::XOMSTS: XOMR2ON Mask            */

#define FMC_XOMSTS_XOMR3ON_Pos           (3)                                               /*!< FMC_T::XOMSTS: XOMR3ON Position        */
#define FMC_XOMSTS_XOMR3ON_Msk           (0x1ul << FMC_XOMSTS_XOMR3ON_Pos)                 /*!< FMC_T::XOMSTS: XOMR3ON Mask            */

#define FMC_XOMSTS_XOMPEF_Pos            (4)                                               /*!< FMC_T::XOMSTS: XOMPEF Position         */
#define FMC_XOMSTS_XOMPEF_Msk            (0x1ul << FMC_XOMSTS_XOMPEF_Pos)                  /*!< FMC_T::XOMSTS: XOMPEF Mask             */

#define FMC_DFCTL_SCRAMEN_Pos            (0)                                               /*!< FMC_T::DFCTL: SCRAMEN Position      */
#define FMC_DFCTL_SCRAMEN_Msk            (0x1ul << FMC_DFCTL_SCRAMEN_Pos)                  /*!< FMC_T::DFCTL: SCRAMEN Mask          */

#define FMC_DFCTL_SILENTEN_Pos           (1)                                               /*!< FMC_T::DFCTL: SILENTEN Position     */
#define FMC_DFCTL_SILENTEN_Msk           (0x1ul << FMC_DFCTL_SILENTEN_Pos)                 /*!< FMC_T::DFCTL: SILENTEN Mask         */

#define FMC_DFSTS_TMPCLRDONE_Pos         (0)                                               /*!< FMC_T::DFSTS: TMPCLRDONE Position    */
#define FMC_DFSTS_TMPCLRDONE_Msk         (0x1ul << FMC_DFSTS_TMPCLRDONE_Pos)               /*!< FMC_T::DFSTS: TMPCLRDONE Mask        */

#define FMC_DFSTS_TMPCLRBUSY_Pos         (1)                                               /*!< FMC_T::DFSTS: TMPCLRBUSY Position    */
#define FMC_DFSTS_TMPCLRBUSY_Msk         (0x1ul << FMC_DFSTS_TMPCLRBUSY_Pos)               /*!< FMC_T::DFSTS: TMPCLRBUSY Mask        */

#define FMC_SCRKEY_SCRKEY_Pos            (0)                                                 /*!< FMC_T::SCRKEY: SCRKEY Position       */
#define FMC_SCRKEY_SCRKEY_Msk            (0xfffffffful << FMC_SCRKEY_SCRKEY_Pos)           /*!< FMC_T::SCRKEY: SCRKEY Mask           */

/**@}*/ /* FMC_CONST */
/**@}*/ /* end of FMC register group */
/**@}*/ /* end of REGISTER group */

#endif /* __FMC_REG_H__ */
